name: "VGG_ILSVRC_16"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 224
input_dim: 224

# 1121 newly added for conv6
input: "labels_conv6"
input_dim: 1 		# to be changed on-the-fly to match input dim
input_dim: 10            # 4(anchors)        
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)

input: "labels_weights_conv6"
input_dim: 1 		# to be changed on-the-fly to match input dim
input_dim: 10            # 4(anchors)        
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)

input: "bbox_targets_conv6"
input_dim: 1  		# to be changed on-the-fly to match input dim
input_dim: 40  		# 4 (coords) * 4(anchors) 
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)

input: "bbox_loss_weights_conv6"
input_dim: 1  		# to be changed on-the-fly to match input dim
input_dim: 40 		# 4 (coords) * 4(anchors) 
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)
input_dim: 7  		# size for 224 input image, to be changed on-the-fly to match input dim, 14--> 28 (resolution doubled)

layer {
	bottom: "data"
	top: "conv1_1"
	name: "conv1_1"
	type: "Convolution"
	param {
		lr_mult: 0.0
	}
	param {
		lr_mult: 0.0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv1_1"
	top: "conv1_1"
	name: "relu1_1"
	type: "ReLU"
}

layer {
	bottom: "conv1_1"
	top: "conv1_2"
	name: "conv1_2"
	param {
		lr_mult: 0.0
	}
	param {
		lr_mult: 0.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv1_2"
	top: "conv1_2"
	name: "relu1_2"
	type: "ReLU"
}

layer {
	bottom: "conv1_2"
	top: "pool1"
	name: "pool1"
	type: "Pooling"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	bottom: "pool1"
	top: "conv2_1"
	name: "conv2_1"
	param {
		lr_mult: 0.0
	}
	param {
		lr_mult: 0.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv2_1"
	top: "conv2_1"
	name: "relu2_1"
	type: "ReLU"
}

layer {
	bottom: "conv2_1"
	top: "conv2_2"
	name: "conv2_2"
	param {
		lr_mult: 0.0
	}
	param {
		lr_mult: 0.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv2_2"
	top: "conv2_2"
	name: "relu2_2"
	type: "ReLU"
}

layer {
	bottom: "conv2_2"
	top: "pool2"
	name: "pool2"
	type: "Pooling"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	bottom: "pool2"
	top: "conv3_1"
	name: "conv3_1"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv3_1"
	top: "conv3_1"
	name: "relu3_1"
	type: "ReLU"
}

layer {
	bottom: "conv3_1"
	top: "conv3_2"
	name: "conv3_2"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv3_2"
	top: "conv3_2"
	name: "relu3_2"
	type: "ReLU"
}

layer {
	bottom: "conv3_2"
	top: "conv3_3"
	name: "conv3_3"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv3_3"
	top: "conv3_3"
	name: "relu3_3"
	type: "ReLU"
}

# 1205: re-add conv4_1~conv4_3 to improve resolution

layer {
	bottom: "conv3_3"
	top: "pool3"
	name: "pool3"
	type: "Pooling"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	bottom: "pool3"
	top: "conv4_1"
	name: "conv4_1"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv4_1"
	top: "conv4_1"
	name: "relu4_1"
	type: "ReLU"
}

layer {
	bottom: "conv4_1"
	top: "conv4_2"
	name: "conv4_2"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv4_2"
	top: "conv4_2"
	name: "relu4_2"
	type: "ReLU"
}

layer {
	bottom: "conv4_2"
	top: "conv4_3"
	name: "conv4_3"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv4_3"
	top: "conv4_3"
	name: "relu4_3"
	type: "ReLU"
}

# -------------------- for conv5's -----------------------------
layer {
	bottom: "conv4_3"
	top: "pool4"
	name: "pool4"
	type: "Pooling"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	bottom: "pool4"
	top: "conv5_1"
	name: "conv5_1"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv5_1"
	top: "conv5_1"
	name: "relu5_1"
	type: "ReLU"
}

layer {
	bottom: "conv5_1"
	top: "conv5_2"
	name: "conv5_2"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv5_2"
	top: "conv5_2"
	name: "relu5_2"
	type: "ReLU"
}

layer {
	bottom: "conv5_2"
	top: "conv5_3"
	name: "conv5_3"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
	type: "Convolution"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
	}
}

layer {
	bottom: "conv5_3"
	top: "conv5_3"
	name: "relu5_3"
	type: "ReLU"
}

# -------------------- for fc6's -----------------------------
layer {
	bottom: "conv5_3"
	top: "pool5"
	name: "pool5"
	type: "Pooling"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "conv6_1"
	bottom: "pool5"
	top: "conv6_1"	
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0
	}
	type: "Convolution"
	convolution_param {
		num_output: 1024
		pad: 1
		kernel_size: 3
		weight_filler {
			type: "xavier"
		}
		bias_filler{
			type: "constant"
			value: 0
		}
	}
}

layer {
	bottom: "conv6_1"
	top: "conv6_1"
	name: "relu6_1"
	type: "ReLU"
}

layer {
	name: "conv6_2"
	bottom: "conv6_1"
	top: "conv6_2"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0
	}
	type: "Convolution"
	convolution_param {
		num_output: 512
		pad: 0
		kernel_size: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler{
			type: "constant"
			value: 0
		}
	}
}

layer {
	bottom: "conv6_2"
	top: "conv6_2"
	name: "relu6_2"
	type: "ReLU"
}

# normal 3x3 conv without atrous
layer {
   name: "conv6_proposal1"
   type: "Convolution"
   bottom: "conv6_2"
   top: "conv6_proposal1"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
   convolution_param{
	   num_output: 512
	   kernel_size: 3
	   pad: 1
	   stride: 1
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 0
	   }
   }
}

# atrous with hole_size = 2
layer {
   name: "conv6_proposal2"
   type: "Convolution"
   bottom: "conv6_2"
   top: "conv6_proposal2"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
   convolution_param{
	   num_output: 512
	   kernel_size: 3
	   pad: 2 #1
	   dilation: 2 #stride: 1
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 0
	   }
   }
}

# atrous with hole_size = 4
layer {
   name: "conv6_proposal3"
   type: "Convolution"
   bottom: "conv6_2"
   top: "conv6_proposal3"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
   convolution_param{
	   num_output: 512
	   kernel_size: 3
	   pad: 4 #1
	   dilation: 4 #stride: 1
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 0
	   }
   }
}

layer {
  name: "concat_proposal_conv6"
  bottom: "conv6_proposal1"
  bottom: "conv6_proposal2"
  bottom: "conv6_proposal3"
  top: "concat_proposal_conv6"
  type: "Concat"
  concat_param {
    axis: 1 # concat channels: 512+512+512 = 1536
  }
}

layer {
   name: "relu_proposal_concat_conv6"
   type: "ReLU"
   bottom: "concat_proposal_conv6"
   top: "concat_proposal_conv6"
}

layer {
   name: "reduce_proposal_conv6"
   type: "Convolution"
   bottom: "concat_proposal_conv6"
   top: "reduce_proposal_conv6"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
   convolution_param{
	   num_output: 512
	   kernel_size: 1
	   pad: 0
	   stride: 1
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 0
	   }
   }
}

layer {
   name: "relu_proposal_reduce_conv6"
   type: "ReLU"
   bottom: "reduce_proposal_conv6"
   top: "reduce_proposal_conv6"
}

layer {
   name: "proposal_cls_score_conv6"
   type: "Convolution"
   bottom: "reduce_proposal_conv6"
   top: "proposal_cls_score_conv6"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
   convolution_param{
	   num_output: 20   # 2(bg/fg) * 4(anchors) 
	   kernel_size: 1
	   pad: 0
	   stride: 1
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 0
	   }
   }
}

layer {
   name: "proposal_bbox_pred_conv6"
   type: "Convolution"
   bottom: "reduce_proposal_conv6"
   top: "proposal_bbox_pred_conv6"
	param {
		lr_mult: 1.0
	}
	param {
		lr_mult: 2.0
	}
   convolution_param{
	   num_output: 40	# 4 * 4(anchors) 
	   kernel_size: 1
	   pad: 0
	   stride: 1
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 0
	   }
   }
}

#-----------------------output3 (for conv6)------------------------

# to enable the calculation of softmax loss, we first reshape blobs related to SoftmaxWithLoss
layer {
   bottom: "proposal_cls_score_conv6"
   top: "proposal_cls_score_reshape_conv6"
   name: "proposal_cls_score_reshape_conv5"
   type: "Reshape"
   reshape_param{
	   shape {
			dim: 0 
			dim: 2
			dim: -1 
			dim: 0
		}
	}
}

layer {
   bottom: "labels_conv6"
   top: "labels_reshape_conv6"
   name: "labels_reshape_conv6"
   type: "Reshape"
   reshape_param{
	   shape {
			dim: 0 
			dim: 1
			dim: -1 
			dim: 0
		}
	}
}

layer {
   bottom: "labels_weights_conv6"
   top: "labels_weights_reshape_conv6"
   name: "labels_weights_reshape_conv6"
   type: "Reshape"
   reshape_param{
	   shape {
			dim: 0 
			dim: 1
			dim: -1 
			dim: 0
		}
	}
}

layer {
   name: "accuarcy_conv6"
   type: "Accuracy"
   bottom: "proposal_cls_score_reshape_conv6"
   bottom: "labels_reshape_conv6"
   top: "accuarcy_conv6"
   accuracy_param {
        ignore_label: -1
   }
}

#---conv6 ohem---
#liu@1114: this layer is off-the-shelf by r-fcn caffe
layer {
   name: "per_anchor_cls_loss_conv6"
   type: "SoftmaxWithLoss"
   bottom: "proposal_cls_score_reshape_conv6"  #[1, 2, 7*7, 7]
   bottom: "labels_reshape_conv6"              #[1, 1, 7*7, 7]
   top: "temp_loss_cls_conv6"  #no use 
   top: "temp_prob_cls_conv6"  #no use
   top: "per_anchor_cls_loss_conv6"            # should be:[1, 1, 7*7, 7]
   loss_weight: 0
   loss_weight: 0
   loss_weight: 0
   loss_param {
        ignore_label: -1
   }
   propagate_down: false
   propagate_down: false
}

layer {
   bottom: "per_anchor_cls_loss_conv6"  #[1, 1, 7*7, 7] == [num ch hei wid]
   bottom: "labels_reshape_conv6"	  #[1, 1, 7*7, 7]
   bottom: "bbox_loss_weights_conv6"    #[1, 4*7, 7, 7]
   bottom: "labels_weights_reshape_conv6"
   top: "labels_ohem_conv6"
   top: "bbox_loss_weights_ohem_conv6"
   top: "labels_weights_ohem_conv6"
   name: "cls_ohem_conv6"
   type: "RpnClsOHEM"
   rpn_cls_ohem_param {
        bg_per_img: 256  #256
	anchor_num: 4
	random_shuffle_percent: 0.9
        ignore_label: -1
   }
   propagate_down: false
   propagate_down: false
   propagate_down: false
   propagate_down: false
}

layer {
   name: "silence"
   type: "Silence"
   bottom: "temp_loss_cls_conv6"
   bottom: "temp_prob_cls_conv6"
}

# final loss cls output 
layer {
   name: "loss_conv6"
   type: "SoftmaxWithLoss"
   bottom: "proposal_cls_score_reshape_conv6"
   bottom: "labels_ohem_conv6"
   bottom: "labels_weights_ohem_conv6"
   top: "loss_cls_conv6"
   loss_weight: 1
   loss_param {
        ignore_label: -1
   }
   propagate_down: true
   propagate_down: false
   propagate_down: false
}

layer {
  name: "loss_bbox_conv6"
  type: "SmoothL1Loss"
  bottom: "proposal_bbox_pred_conv6" #[1 28 7 7]
  bottom: "bbox_targets_conv6"       #[1 28 7 7]
  bottom: "bbox_loss_weights_ohem_conv6"  #[1 28 7 7]
  top: "loss_bbox_conv6"
  loss_weight: 5
}
